
// 1) Создать двумерный массив (с нулями) спрашивая у пользователя его размерность
// let length = 5;
// let arr = [
//     [0, 0, 0, 0, 0],
//     [0, 0, 0, 0, 0],
//     [0, 0, 0, 0, 0],
//     [0, 0, 0, 0, 0],
//     [0, 0, 0, 0, 0]
//   ];
//   console.log(arr);

// let arr=prompt ("Ведите размер масива");
// let table = new Array(+arr);
// for (let i = 0; i < table.length; i++) { 
//     table[i] = new Array(+arr);            
// }
// for (let row = 0; row < table.length; row++) {
//     for (let col = 0; col < table[row].length; col++) {
//         table[row][col] = 0;
//         document.write(table[row][col]);           
//     } 
//    document.write("<br>");
//    }
// console.log(table);


// 2) Если пользователь ввел неправильный объем памяти - переспрашивать.
// Если пользователь нажал отмена - выходить.
// Если пользователь ввел корректный объем памяти спрашивать у него цвет телефона
// Если все введено вверно и пользователь нигде не нажал отмена - выводить (document.write) цену и картинку телефона

// Спросили память
// если память корректная
// спросили цвет
// есл цвет и память правильные то выводить картинку и цену на экран
// while() {

// }
// while(заходить в этот цикл только тогда, когда ввел память) {

// }

// 3) Цена телеофна зависит не только от памяти, но и от цвета
// 64gb silver - 300
// 64gb black - 300 + наценка за цвет(3$)
// Используйте массивы для хранения ВСЕХ ПАМЯТЕЙ и ЦВЕТОВ
// let memories = [64,128,256]

// посмотреть методы массивов

